In [1]:
#2.a
import pandas as pd
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [2]:
#2.b
S1=pd.Series([100,200,300,400,500],index=['A','B','C','D','E'])
S2=pd.Series([1,2,3,4,5],index=['A','B','C','D','E'])
print(S1*S2)

A     100
B     400
C     900
D    1600
E    2500
dtype: int64

In [3]:
#2.c
import numpy as np
array1=np.array([100,200,300,400,500,600,700])
print(array1[1:5:2])

[200 400]

In [4]:
#2.d
data = [['Anuj',21],['Rama',25],['Kapil',22]]
df = pd.DataFrame(data,columns=['Name','Age'])
print (df)

    Name  Age
0   Anuj   21
1   Rama   25
2  Kapil   22

In [5]:
#2.e
df = pd.DataFrame()
print (df)

Empty DataFrame
Columns: []
Index: []

In [6]:
#3
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily','Michael',\
'Matthew', 'Laura', 'Kevin', 'Jonas'],'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],\
'labels' : ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify labels
0  Anastasia   12.5         1     yes      a
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c
3      James    NaN         3      no      d
4      Emily    9.0         2      no      e
5    Michael   20.0         3     yes      f
6    Matthew   14.5         1     yes      g
7      Laura    NaN         1      no      h
8      Kevin    8.0         2      no      i
9      Jonas   19.0         1     yes      j

In [7]:
#4
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily','Michael',\
'Matthew', 'Laura', 'Kevin', 'Jonas'],'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],\
'labels' : ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}
df = pd.DataFrame(exam_data)
df = df[["name","score"]]
print(df)

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9      Jonas   19.0

In [8]:
#5
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily','Michael',\
'Matthew', 'Laura', 'Kevin', 'Jonas'],'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],\
'labels' : ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}
df = pd.DataFrame(exam_data)
df.head(3)

        name  score  attempts qualify labels
0  Anastasia   12.5         1     yes      a
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c

In [9]:
#6
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily','Michael',\
'Matthew', 'Laura', 'Kevin', 'Jonas'],'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],\
'labels' : ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}
df = pd.DataFrame(exam_data)
df = df[df['attempts']>=2]
print(df)

        name  score  attempts qualify labels
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c
3      James    NaN         3      no      d
4      Emily    9.0         2      no      e
5    Michael   20.0         3     yes      f
8      Kevin    8.0         2      no      i

In [10]:
#7
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily','Michael',\
'Matthew', 'Laura', 'Kevin', 'Jonas'],'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],\
'labels' : ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}
df = pd.DataFrame(exam_data)
df.shape

(10, 5)

In [12]:
#8
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily','Michael',\
'Matthew', 'Laura', 'Kevin', 'Jonas'],'score': [12.5, 9, 16.5, 5, 9, 20, 14.5, 6, 8, 19],\
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],\
'labels' : ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}
df = pd.DataFrame(exam_data)
print("The sum is ",df['score'].sum())

The sum is  119.5

In [13]:
#9
df = df.sort_values(by=['name','score'],ascending=[False,True])
print(df)

        name  score  attempts qualify labels
5    Michael   20.0         3     yes      f
6    Matthew   14.5         1     yes      g
7      Laura    6.0         1      no      h
8      Kevin    8.0         2      no      i
2  Katherine   16.5         2     yes      c
9      Jonas   19.0         1     yes      j
3      James    5.0         3      no      d
4      Emily    9.0         2      no      e
1       Dima    9.0         3      no      b
0  Anastasia   12.5         1     yes      a

In [15]:
#10
df = df.drop(['attempts'],axis = 1)
print(df)

        name  score qualify labels
5    Michael   20.0     yes      f
6    Matthew   14.5     yes      g
7      Laura    6.0      no      h
8      Kevin    8.0      no      i
2  Katherine   16.5     yes      c
9      Jonas   19.0     yes      j
3      James    5.0      no      d
4      Emily    9.0      no      e
1       Dima    9.0      no      b
0  Anastasia   12.5     yes      a